       IDENTIFICATION DIVISION.
       PROGRAM-ID. GERAFOR.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
      ***
      *** DEFINE OS ARQUIVOS DE ENTRADA E SAIDA
      ***
       FILE-CONTROL.
           SELECT ARQCAD ASSIGN TO "FORNECE.DAT"
             ORGANIZATION IS SEQUENTIAL
             ACCESS MODE IS SEQUENTIAL
             FILE STATUS IS ST-ALU.
       DATA DIVISION.
       FILE SECTION.
       FD  ARQCAD.
       01  REG-FORNECEDOR.
            05  CDFORN PIC 9(03).
            05  NMFORM    PIC  X(30).
            05  NMCIDADE    PIC  X(30).
       WORKING-STORAGE SECTION.
       77  ST-ALU       PIC X(02).
       PROCEDURE DIVISION.
       INICIO.
           PERFORM ABRE-ARQ.
           PERFORM PROCESSO.
           PERFORM FINALIZA.
           STOP RUN.
       ABRE-ARQ.
           OPEN OUTPUT ARQCAD.
           IF ST-ALU NOT EQUAL '00'
              DISPLAY 'ERRO DE ABERTURA - CAD ALUNO' ST-ALU
              STOP RUN.
       PROCESSO.
           MOVE 001 TO CDFORN.
           MOVE 'ISM' TO NMFORM.
           MOVE 'SAO PAULO' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 013 TO CDFORN.
           MOVE 'DECADRON' TO NMFORM.
           MOVE 'RIO DE JANEIRO' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 026 TO CDFORN.
           MOVE 'SES SYSTEMS' TO NMFORM.
           MOVE 'SANTOS' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 048 TO CDFORN.
           MOVE 'ENTERDATA' TO NMFORM.
           MOVE 'SANTOS' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 191 TO CDFORN.
           MOVE 'DIGITAL' TO NMFORM.
           MOVE 'RIO DE JANEIRO' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 234 TO CDFORN.
           MOVE 'NETDB' TO NMFORM.
           MOVE 'SANTOS' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 420 TO CDFORN.
           MOVE 'CENTERSOFT' TO NMFORM.
           MOVE 'SANTOS' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

           MOVE 518 TO CDFORN.
           MOVE 'TRTEC' TO NMFORM.
           MOVE 'CAMPINAS' TO NMCIDADE.
           WRITE REG-FORNECEDOR.

       FINALIZA.
           CLOSE ARQCAD.
